In [3]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('tourism_data.csv')

In [4]:
df

    LocationID  Country    Category  Visitors  Rating
0        L0001    Egypt  City Break   4094924     1.7
1        L0002   France  City Break   1012015     2.2
2        L0003   Turkey      Skiing   1880716     2.8
3        L0004  Germany    Cultural   1410578     5.0
4        L0005   Turkey       Beach   1882660     1.9
..         ...      ...         ...       ...     ...
995      L0996    Egypt    Cultural   1591467     2.3
996      L0997   Mexico  Historical   2672239     3.1
997      L0998    Spain    Cultural   4432964     4.6
998      L0999    Japan    Cultural   4869970     2.6
999      L1000      USA      Nature    305570     2.8

[1000 rows x 5 columns]

In [5]:
df.shape

(1000, 5)

In [7]:
df.dtypes

LocationID     object
Country        object
Category       object
Visitors        int64
Rating        float64
dtype: object

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   LocationID  1000 non-null   object
 1   Country     1000 non-null   object
 2   Category    1000 non-null   object
 3   Visitors    1000 non-null   int64
 4   Rating      1000 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 39.2+ KB

In [ ]:
df.describe()

           Visitors       Rating
count  1.000000e+03  1000.000000
mean   2.487092e+06     2.987000
std    1.424705e+06     1.153482
min    1.011020e+05     1.000000
25%    1.283626e+06     2.000000
50%    2.415372e+06     3.000000
75%    3.737560e+06     4.000000
max    4.992961e+06     5.000000

In [8]:
df.head(5)

  LocationID  Country    Category  Visitors  Rating
0      L0001    Egypt  City Break   4094924     1.7
1      L0002   France  City Break   1012015     2.2
2      L0003   Turkey      Skiing   1880716     2.8
3      L0004  Germany    Cultural   1410578     5.0
4      L0005   Turkey       Beach   1882660     1.9

In [9]:
df.tail(5)

    LocationID Country    Category  Visitors  Rating
995      L0996   Egypt    Cultural   1591467     2.3
996      L0997  Mexico  Historical   2672239     3.1
997      L0998   Spain    Cultural   4432964     4.6
998      L0999   Japan    Cultural   4869970     2.6
999      L1000     USA      Nature    305570     2.8

In [10]:
df.isnull().sum()

LocationID    0
Country       0
Category      0
Visitors      0
Rating        0
dtype: int64

no duplicates found

In [12]:
grouping = df.groupby('Country')['Visitors'].max()

In [13]:
grouping

Country
Argentina       4956879
Australia       4905826
Brazil          4803453
Canada          4949816
China           4865350
Egypt           4984865
France          4973556
Germany         4958931
Greece          4653971
India           4992961
Italy           4952322
Japan           4869970
Mexico          4914490
New Zealand     4812759
Peru            4906605
South Africa    4992770
Spain           4892947
Thailand        4955530
Turkey          4958702
USA             4821046
Name: Visitors, dtype: int64

In [14]:
top_5 = grouping.sort_values(ascending = False).nlargest(5)

In [15]:
top_5

Country
India           4992961
South Africa    4992770
Egypt           4984865
France          4973556
Germany         4958931
Name: Visitors, dtype: int64

In [21]:
#converting into dictionary
result = [{'Country': country, 'Total_Visitors': visitors} 
          for country, visitors in top_5.items()]

In [22]:
result

[{'Country': 'India', 'Total_Visitors': 4992961},
 {'Country': 'South Africa', 'Total_Visitors': 4992770},
 {'Country': 'Egypt', 'Total_Visitors': 4984865},
 {'Country': 'France', 'Total_Visitors': 4973556},
 {'Country': 'Germany', 'Total_Visitors': 4958931}]

Average rating of each category

In [12]:
avg_rating  = df.groupby('Category')['Rating'].mean()

In [13]:
avg_rating

Category
Adventure     3.135211
Beach         2.935256
City Break    2.930769
Cultural      3.053896
Historical    3.022464
Nature        2.947328
Skiing        2.871545
Name: Rating, dtype: float64

In [14]:
result  = [{'Category Names':Category , 'Average Rating':round(Rating , 2)} for Category, Rating in avg_rating.items()]

In [30]:
result

[{'Category Names': 'Adventure', 'Average Rating': 3.14},
 {'Category Names': 'Beach', 'Average Rating': 2.94},
 {'Category Names': 'City Break', 'Average Rating': 2.93},
 {'Category Names': 'Cultural', 'Average Rating': 3.05},
 {'Category Names': 'Historical', 'Average Rating': 3.02},
 {'Category Names': 'Nature', 'Average Rating': 2.95},
 {'Category Names': 'Skiing', 'Average Rating': 2.87}]

In [33]:
max_rating_index = df['Rating'].idxmax()

In [34]:
max_rating_index

3

In [35]:
max_rating_value = df['Rating'].max()

In [36]:
max_rating_value

np.float64(5.0)

In [ ]:
highest_rated = df.loc[max_rating_index] 
highest_rated

LocationID       L0004
Country        Germany
Category      Cultural
Visitors       1410578
Rating             5.0
Name: 3, dtype: object

In [38]:
country = highest_rated['Country']
country

'Germany'

In [43]:
correlation = df['Visitors'].corr(df['Rating'])
result = round(correlation, 3)

In [42]:
result

np.float64(-0.053)

In [44]:
correlation

np.float64(-0.0529925337316219)

shows moderate negative correlation

**Insights**

Identified the top 5 countries with highest number of visitors: India tops the list

Calculated the average rating of each category: Highest rating is for Adventure category

Germany is the highest rated location

Identified the pearson coefficient between visitors and Rating which shows a moderate negative correlation which means as one increases other decreases directly in proportion.